import Checkbox from '@mui/material/Checkbox';
/**
 * @breif 게시판 종류 정의
 * @details 사이드바에서 사용되는 종류들을 모두 enum 열거형으로 관리한다.
 */

export enum Board {
  '마일리지 타입',
  '마일리지 카테고리',
  '마일리지 글로벌 항목',
  '마일리지 학기별 항목',
  '마일리지 조회',
  '마일리지 등록',
  '신청자 관리',
  '학생 관리',
  '관리자',
  '학생별 마일리지 현황',
  '마일리지 선정결과',
  '신청 기간 설정',
  '통계',
}

/**
 * @breif 게시판 종류 리스트
 */

export const BoardList = [
  '마일리지 타입',
  '마일리지 카테고리',
  '마일리지 글로벌 항목',
  '마일리지 학기별 항목',
  '마일리지 조회',
  '마일리지 등록',
  '신청자 관리',
  '학생 관리',
  '관리자',
  '학생별 마일리지 현황',
  '마일리지 선정결과',
  '신청 기간 설정',
  '통계',
];
